cf/Documents/КорректировкаДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаСчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаСчет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоПартнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/КорректировкаДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьОстатки(Кассы)
	
	Запрос = Новый Запрос(СтрШаблон("ВЫБРАТЬ Касса, СуммаОстаток Сумма ИЗ РегистрНакопления.ДенежныеСредства.Остатки(%1, Касса В(&Кассы))", ?(Объект.Ссылка.Пустая(), "","&Дата")));
	Запрос.УстановитьПараметр("Дата", 	Объект.Дата);
	Запрос.УстановитьПараметр("Кассы", 	Кассы);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокКассы(Касса)
	
	Ост = ПолучитьОстатки(Касса);
	текСтрока = Ост.Найти(Касса, "Касса");
	Возврат ?(текСтрока = Неопределено, 0, текСтрока.Сумма);
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОстаткиКассы = ПолучитьОстатки(ТекущийОбъект.Состав.Выгрузить().ВыгрузитьКолонку("КассаСчет"));
	
	// Получим остатки
	
	Для КАждого Строка ИЗ Объект.Состав Цикл
		текСтрока = ОстаткиКассы.Найти(Строка.КассаСчет, "Касса");
		Если текСтрока <> Неопределено Тогда
			Строка.Остаток 		= текСтрока.Сумма; 
			Строка.Результат 	= текСтрока.Сумма + Строка.Сумма;  КонецЕсли; КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	
	текДанные = Элементы.Состав.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.Остаток 	= ПолучитьОстатокКассы(текДанные.КассаСчет); 
		текДанные.Результат = текДанные.Остаток + текДанные.Сумма; КонецЕсли;
	
КонецПроцедуры
